000_РОЗНИЦА_ЦЕНТР/src/Catalogs/СтруктураУзлов/СтруктураУзлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураУзлов</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>MSDyn_CRM</name>
      <description>MS Dynamics CRM</description>
    </items>
    <items>
      <name>КСУ_Navision</name>
      <description>Корпоративная Система Управления (внешний источник Navision)</description>
    </items>
    <items>
      <name>ЦентральныйОфис</name>
      <description>ЦЕНТРАЛЬНЫЙ ОФИС</description>
    </items>
  </predefined>
  <attributes>
    <name>Account</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BaseName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Password</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServerAddress</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияОС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПриложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидУзла</name>
    <type>
      <types>EnumRef.ВидыУзлов</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогФайловОбновления</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогФайловРезервныхКопий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПрограммы</name>
    <type>
      <types>EnumRef.ПрограммаМобильногоУстройства</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧрезвычайноеПоложение</name>
    <comment>Вне доступа из-за войны</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Алгоритмы</name>
    <attributes>
      <name>Алгоритм</name>
      <comment>Алгоритм, назначенный для выполнения в текущем узле</comment>
      <type>
        <types>CatalogRef.Алгоритмы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыполнятьАлгоритм</name>
      <type>
        <types>EnumRef.ВыполнятьАлгоритм</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Магазины</name>
    <attributes>
      <name>Магазин</name>
      <type>
        <types>CatalogRef.Магазины</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолноеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПроизвольныеДанные</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Данные</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезервныеКопии</name>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСоздания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СетевыеИнтерфейсы</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/CommonForms/ФормаОтчетов7/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	УстановитьПривилегированныйРежим(Истина);
	ЦО = Справочники.СтруктураУзлов.ЦентральныйОфис.ПолучитьОбъект();

	СтрокаТаблицы = ЦО.ПроизвольныеДанные.Найти("СоответствиеОтчетовИз7","Ключ");
	
	Попытка
	
		ТЗ.Загрузить(СтрокаТаблицы.Данные.Получить());
	
	Исключение	
	КонецПопытки;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии()
	ПриЗакрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	ЦО = Справочники.СтруктураУзлов.ЦентральныйОфис.ПолучитьОбъект();

	СтрокаТаблицы = ЦО.ПроизвольныеДанные.Найти("СоответствиеОтчетовИз7","Ключ");
	Если СтрокаТаблицы = Неопределено Тогда
	
		СтрокаТаблицы = ЦО.ПроизвольныеДанные.Добавить();
		СтрокаТаблицы.Ключ = "СоответствиеОтчетовИз7";
	   		
	КонецЕсли;

	СтрокаТаблицы.Данные = Новый ХранилищеЗначения(ТЗ.Выгрузить(), Новый СжатиеДанных(9));

	ЦО.Записать();
	
КонецПроцедуры


&НаКлиенте
Процедура ТЗВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Вариант = ЭтотОбъект.Элементы.ТЗ.ТекущиеДанные.ОтчетВРознице;
	ВариантОбъект = ПолучитьОбъектВарианта(Вариант);
	
	Уникальность = "Отчет." + ВариантОбъект.ИмяОтчета;
		Если ЗначениеЗаполнено(ВариантОбъект.КлючВарианта) Тогда
			Уникальность = Уникальность + "/КлючВарианта." + ВариантОбъект.КлючВарианта;
		КонецЕсли;
	ИмяОтчета = ВариантОбъект.ИмяОтчета;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КлючВарианта", ВариантОбъект.КлючВарианта);
	ПараметрыОткрытия.Вставить("КлючПараметровПечати", );
	ПараметрыОткрытия.Вставить("КлючСохраненияПоложенияОкна", );
	
	ОткрытьФорму("Отчет." + ИмяОтчета + ".Форма", ПараметрыОткрытия, Неопределено, );
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОбъектВарианта(Вариант)

	 ВариантОбъект = Вариант.ПолучитьОбъект();
	 Возврат Новый Структура("КлючВарианта, ИмяОтчета", Вариант.КлючВарианта, Вариант.Отчет.Имя); 

КонецФункции // ПолучитьОбъектВарианта(Вариант);()
